[Survived] BlockStatement
tracker/static/js/daily_summary.js:4:71
 // daily_summary.js
 
 // Collapse sections
-document.querySelectorAll('.food-section-content').forEach(content => {
-    if (content.children.length === 0) {
-      content.style.maxHeight = '0px';
-    } else {
-      content.style.maxHeight = content.scrollHeight + 'px';
-    }
-  });
+document.querySelectorAll('.food-section-content').forEach(content => {});
   
   document.querySelectorAll('.food-section-toggle').forEach(header => {

[Survived] EqualityOperator
tracker/static/js/daily_summary.js:5:9
 
 // Collapse sections
 document.querySelectorAll('.food-section-content').forEach(content => {
-    if (content.children.length === 0) {
+    if (content.children.length !== 0) {
       content.style.maxHeight = '0px';
     } else {

[Survived] BlockStatement
tracker/static/js/daily_summary.js:5:40
 
 // Collapse sections
 document.querySelectorAll('.food-section-content').forEach(content => {
-    if (content.children.length === 0) {
-      content.style.maxHeight = '0px';
-    } else {
+    if (content.children.length === 0) {} else {
       content.style.maxHeight = content.scrollHeight + 'px';
     }

[Survived] BlockStatement
tracker/static/js/daily_summary.js:7:12
 document.querySelectorAll('.food-section-content').forEach(content => {
     if (content.children.length === 0) {
       content.style.maxHeight = '0px';
-    } else {
-      content.style.maxHeight = content.scrollHeight + 'px';
-    }
+    } else {}
   });
   

[Survived] BlockStatement
tracker/static/js/daily_summary.js:12:71
     }
   });
   
-  document.querySelectorAll('.food-section-toggle').forEach(header => {
-    header.addEventListener('click', () => {
-      const content = header.nextElementSibling;
-      const chevron = header.querySelector('.chevron-icon');
-      chevron.classList.toggle('rotate-180');
-      if (content.style.maxHeight && content.style.maxHeight !== '0px') {
-        content.style.maxHeight = '0px';
-      } else {
-        content.style.maxHeight = content.scrollHeight + 'px';
-      }
-    });
-  });
+  document.querySelectorAll('.food-section-toggle').forEach(header => {});
   
   // Add food modal

[Survived] StringLiteral
tracker/static/js/daily_summary.js:12:29
     }
   });
   
-  document.querySelectorAll('.food-section-toggle').forEach(header => {
+  document.querySelectorAll("").forEach(header => {
     header.addEventListener('click', () => {
       const content = header.nextElementSibling;

[NoCoverage] BlockStatement
tracker/static/js/daily_summary.js:13:44
   });
   
   document.querySelectorAll('.food-section-toggle').forEach(header => {
-    header.addEventListener('click', () => {
-      const content = header.nextElementSibling;
-      const chevron = header.querySelector('.chevron-icon');
-      chevron.classList.toggle('rotate-180');
-      if (content.style.maxHeight && content.style.maxHeight !== '0px') {
-        content.style.maxHeight = '0px';
-      } else {
-        content.style.maxHeight = content.scrollHeight + 'px';
-      }
-    });
+    header.addEventListener('click', () => {});
   });
   

[Survived] StringLiteral
tracker/static/js/daily_summary.js:13:29
   });
   
   document.querySelectorAll('.food-section-toggle').forEach(header => {
-    header.addEventListener('click', () => {
+    header.addEventListener("", () => {
       const content = header.nextElementSibling;
       const chevron = header.querySelector('.chevron-icon');

[NoCoverage] StringLiteral
tracker/static/js/daily_summary.js:16:32
     header.addEventListener('click', () => {
       const content = header.nextElementSibling;
       const chevron = header.querySelector('.chevron-icon');
-      chevron.classList.toggle('rotate-180');
+      chevron.classList.toggle("");
       if (content.style.maxHeight && content.style.maxHeight !== '0px') {
         content.style.maxHeight = '0px';

[NoCoverage] ConditionalExpression
tracker/static/js/daily_summary.js:17:11
       const content = header.nextElementSibling;
       const chevron = header.querySelector('.chevron-icon');
       chevron.classList.toggle('rotate-180');
-      if (content.style.maxHeight && content.style.maxHeight !== '0px') {
+      if (false) {
         content.style.maxHeight = '0px';
       } else {

[NoCoverage] ConditionalExpression
tracker/static/js/daily_summary.js:17:11
       const content = header.nextElementSibling;
       const chevron = header.querySelector('.chevron-icon');
       chevron.classList.toggle('rotate-180');
-      if (content.style.maxHeight && content.style.maxHeight !== '0px') {
+      if (true) {
         content.style.maxHeight = '0px';
       } else {

[Survived] StringLiteral
tracker/static/js/daily_summary.js:26:44
   });
   
   // Add food modal
-  const addModal = document.getElementById('food-entry-modal');
+  const addModal = document.getElementById("");
   const addButtons = document.querySelectorAll('.add-food-btn');
   const addCancelBtn = document.getElementById('cancel-food-btn');

[Survived] StringLiteral
tracker/static/js/daily_summary.js:27:48
   
   // Add food modal
   const addModal = document.getElementById('food-entry-modal');
-  const addButtons = document.querySelectorAll('.add-food-btn');
+  const addButtons = document.querySelectorAll("");
   const addCancelBtn = document.getElementById('cancel-food-btn');
   const addForm = document.getElementById('food-entry-form');

[Survived] StringLiteral
tracker/static/js/daily_summary.js:28:48
   // Add food modal
   const addModal = document.getElementById('food-entry-modal');
   const addButtons = document.querySelectorAll('.add-food-btn');
-  const addCancelBtn = document.getElementById('cancel-food-btn');
+  const addCancelBtn = document.getElementById("");
   const addForm = document.getElementById('food-entry-form');
   

[Survived] BlockStatement
tracker/static/js/daily_summary.js:31:29
   const addCancelBtn = document.getElementById('cancel-food-btn');
   const addForm = document.getElementById('food-entry-form');
   
-  addButtons.forEach(btn => {
-    btn.addEventListener('click', e => {
-      e.stopPropagation();
-      addForm.reset();
-      addModal.classList.remove('hidden');
-    });
-  });
+  addButtons.forEach(btn => {});
   
   addCancelBtn.addEventListener('click', () => {

[NoCoverage] BlockStatement
tracker/static/js/daily_summary.js:32:40
   const addForm = document.getElementById('food-entry-form');
   
   addButtons.forEach(btn => {
-    btn.addEventListener('click', e => {
-      e.stopPropagation();
-      addForm.reset();
-      addModal.classList.remove('hidden');
-    });
+    btn.addEventListener('click', e => {});
   });
   

[Survived] StringLiteral
tracker/static/js/daily_summary.js:32:26
   const addForm = document.getElementById('food-entry-form');
   
   addButtons.forEach(btn => {
-    btn.addEventListener('click', e => {
+    btn.addEventListener("", e => {
       e.stopPropagation();
       addForm.reset();

[NoCoverage] StringLiteral
tracker/static/js/daily_summary.js:35:33
     btn.addEventListener('click', e => {
       e.stopPropagation();
       addForm.reset();
-      addModal.classList.remove('hidden');
+      addModal.classList.remove("");
     });
   });

[NoCoverage] BlockStatement
tracker/static/js/daily_summary.js:39:48
     });
   });
   
-  addCancelBtn.addEventListener('click', () => {
-    addModal.classList.add('hidden');
-  });
+  addCancelBtn.addEventListener('click', () => {});
   
   // Edit food modal

[Survived] StringLiteral
tracker/static/js/daily_summary.js:39:33
     });
   });
   
-  addCancelBtn.addEventListener('click', () => {
+  addCancelBtn.addEventListener("", () => {
     addModal.classList.add('hidden');
   });

[NoCoverage] StringLiteral
tracker/static/js/daily_summary.js:40:28
   });
   
   addCancelBtn.addEventListener('click', () => {
-    addModal.classList.add('hidden');
+    addModal.classList.add("");
   });
   

[Survived] BlockStatement
tracker/static/js/daily_summary.js:44:59
   });
   
   // Edit food modal
-  document.querySelectorAll('.food-item').forEach(item => {
-    item.addEventListener('click', () => {
-      const editModal = document.getElementById('food-edit-modal');
-      const editForm = document.getElementById('food-edit-form');
-  
-      editModal.classList.remove('hidden');
-      editForm.querySelector('[name="food_id"]').value = item.dataset.id;
-      editForm.querySelector('[name="name"]').value = item.dataset.name;
-      editForm.querySelector('[name="calories"]').value = item.dataset.calories;
-      editForm.querySelector('[name="protein"]').value = item.dataset.protein;
-      editForm.querySelector('[name="carbs"]').value = item.dataset.carbs;
-      editForm.querySelector('[name="fat"]').value = item.dataset.fat;
-    });
-  });
+  document.querySelectorAll('.food-item').forEach(item => {});
   
   document.getElementById('cancel-edit-btn').addEventListener('click', () => {

[Survived] StringLiteral
tracker/static/js/daily_summary.js:44:29
   });
   
   // Edit food modal
-  document.querySelectorAll('.food-item').forEach(item => {
+  document.querySelectorAll("").forEach(item => {
     item.addEventListener('click', () => {
       const editModal = document.getElementById('food-edit-modal');

[Survived] BlockStatement
tracker/static/js/daily_summary.js:45:42
   
   // Edit food modal
   document.querySelectorAll('.food-item').forEach(item => {
-    item.addEventListener('click', () => {
-      const editModal = document.getElementById('food-edit-modal');
-      const editForm = document.getElementById('food-edit-form');
-  
-      editModal.classList.remove('hidden');
-      editForm.querySelector('[name="food_id"]').value = item.dataset.id;
-      editForm.querySelector('[name="name"]').value = item.dataset.name;
-      editForm.querySelector('[name="calories"]').value = item.dataset.calories;
-      editForm.querySelector('[name="protein"]').value = item.dataset.protein;
-      editForm.querySelector('[name="carbs"]').value = item.dataset.carbs;
-      editForm.querySelector('[name="fat"]').value = item.dataset.fat;
-    });
+    item.addEventListener('click', () => {});
   });
   

[Survived] StringLiteral
tracker/static/js/daily_summary.js:46:49
   // Edit food modal
   document.querySelectorAll('.food-item').forEach(item => {
     item.addEventListener('click', () => {
-      const editModal = document.getElementById('food-edit-modal');
+      const editModal = document.getElementById("");
       const editForm = document.getElementById('food-edit-form');
   

[Survived] StringLiteral
tracker/static/js/daily_summary.js:47:48
   document.querySelectorAll('.food-item').forEach(item => {
     item.addEventListener('click', () => {
       const editModal = document.getElementById('food-edit-modal');
-      const editForm = document.getElementById('food-edit-form');
+      const editForm = document.getElementById("");
   
       editModal.classList.remove('hidden');

[Survived] StringLiteral
tracker/static/js/daily_summary.js:50:30
       const editForm = document.getElementById('food-edit-form');
   
       editModal.classList.remove('hidden');
-      editForm.querySelector('[name="food_id"]').value = item.dataset.id;
+      editForm.querySelector("").value = item.dataset.id;
       editForm.querySelector('[name="name"]').value = item.dataset.name;
       editForm.querySelector('[name="calories"]').value = item.dataset.calories;

[Survived] StringLiteral
tracker/static/js/daily_summary.js:51:30
   
       editModal.classList.remove('hidden');
       editForm.querySelector('[name="food_id"]').value = item.dataset.id;
-      editForm.querySelector('[name="name"]').value = item.dataset.name;
+      editForm.querySelector("").value = item.dataset.name;
       editForm.querySelector('[name="calories"]').value = item.dataset.calories;
       editForm.querySelector('[name="protein"]').value = item.dataset.protein;

[Survived] StringLiteral
tracker/static/js/daily_summary.js:52:30
       editModal.classList.remove('hidden');
       editForm.querySelector('[name="food_id"]').value = item.dataset.id;
       editForm.querySelector('[name="name"]').value = item.dataset.name;
-      editForm.querySelector('[name="calories"]').value = item.dataset.calories;
+      editForm.querySelector("").value = item.dataset.calories;
       editForm.querySelector('[name="protein"]').value = item.dataset.protein;
       editForm.querySelector('[name="carbs"]').value = item.dataset.carbs;

[Survived] StringLiteral
tracker/static/js/daily_summary.js:54:30
       editForm.querySelector('[name="name"]').value = item.dataset.name;
       editForm.querySelector('[name="calories"]').value = item.dataset.calories;
       editForm.querySelector('[name="protein"]').value = item.dataset.protein;
-      editForm.querySelector('[name="carbs"]').value = item.dataset.carbs;
+      editForm.querySelector("").value = item.dataset.carbs;
       editForm.querySelector('[name="fat"]').value = item.dataset.fat;
     });

[NoCoverage] BlockStatement
tracker/static/js/daily_summary.js:59:78
     });
   });
   
-  document.getElementById('cancel-edit-btn').addEventListener('click', () => {
-    document.getElementById('food-edit-modal').classList.add('hidden');
-  });
+  document.getElementById('cancel-edit-btn').addEventListener('click', () => {});
   

[NoCoverage] StringLiteral
tracker/static/js/daily_summary.js:60:62
   });
   
   document.getElementById('cancel-edit-btn').addEventListener('click', () => {
-    document.getElementById('food-edit-modal').classList.add('hidden');
+    document.getElementById('food-edit-modal').classList.add("");
   });
   
