[Survived] ConditionalExpression
tracker/static/js/daily_summary.js:5:9
 
 // Collapse sections
 document.querySelectorAll('.food-section-content').forEach(content => {
-    if (content.children.length === 0) {
+    if (false) {
       content.style.maxHeight = '0px';
     } else {
